Cooper3516833584/ESP32S3_Vision/project/CameraWebServer/app_httpd.cpp
// Copyright 2015-2016 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#include "esp_http_server.h"
#include "esp_timer.h"
#include "esp_camera.h"
#include <Arduino.h>
#include <WiFi.h>
#include <atomic>
#include "img_converters.h"
#include "fb_gfx.h"
#include "esp32-hal-ledc.h"
#include "lwip/sockets.h"
#include "lwip/tcp.h"
#include "sdkconfig.h"
#include "board_config.h"
#include "camera_base.h"
#include "project_config.h"
#include "raw_frame_codec.h"
#include "camera_web_viewer.h"

#if defined(ARDUINO_ARCH_ESP32) && defined(CONFIG_ARDUHAL_ESP_LOG)
#include "esp32-hal-log.h"
#endif

// LED FLASH setup
#if defined(LED_GPIO_NUM)
#define CONFIG_LED_MAX_INTENSITY 255

int led_duty = 0;
bool isStreaming = false;

#endif

typedef struct {
  httpd_req_t *req;
  size_t len;
} jpg_chunking_t;

#define PART_BOUNDARY "123456789000000000000987654321"
static const char *_STREAM_CONTENT_TYPE = "multipart/x-mixed-replace;boundary=" PART_BOUNDARY;
static const char *_STREAM_BOUNDARY = "\r\n--" PART_BOUNDARY "\r\n";
static const char *_STREAM_PART = "Content-Type: image/jpeg\r\nContent-Length: %u\r\nX-Timestamp: %d.%06d\r\n\r\n";

httpd_handle_t stream_httpd = NULL;
httpd_handle_t camera_httpd = NULL;

static std::atomic_bool stream_client_active(false);
static std::atomic<uint32_t> stream_frames(0);
static std::atomic<uint32_t> stream_send_failures(0);
static std::atomic<uint32_t> stream_last_frame_ms(0);
static std::atomic<uint32_t> stream_last_frame_bytes(0);
static std::atomic<uint32_t> stream_fps_x10(0);
static std::atomic<uint32_t> processing_frames(0);
static std::atomic<uint32_t> processing_fps_x10(0);
static std::atomic<uint32_t> processing_last_time_us(0);
static std::atomic<uint32_t> processing_last_report_us(0);
static std::atomic<CameraBaseFrameProcessor> frame_processor(nullptr);
static std::atomic<void *> frame_processor_context(nullptr);

void cameraBaseSetFrameProcessor(CameraBaseFrameProcessor processor, void *userContext) {
  // Publish the context before the callback. Typical use registers once in setup().
  frame_processor.store(nullptr);
  frame_processor_context.store(userContext);
  frame_processor.store(processor);
}

void cameraBaseReportProcessingFrame(uint32_t processTimeUs) {
  const uint32_t now = micros();
  const uint32_t previousReport = processing_last_report_us.exchange(now);
  processing_frames.fetch_add(1);
  processing_last_time_us.store(processTimeUs);

  if (previousReport != 0) {
    const uint32_t intervalUs = now - previousReport;
    const uint32_t instantFpsX10 = intervalUs ? (10000000U / intervalUs) : 0;
    const uint32_t previousFpsX10 = processing_fps_x10.load();
    processing_fps_x10.store(
      previousFpsX10 ? ((previousFpsX10 * 7U + instantFpsX10 * 3U) / 10U) : instantFpsX10
    );
  }
}

static void processFrameForVision(const camera_fb_t *frame) {
  CameraBaseFrameProcessor processor = frame_processor.load();
  if (processor == nullptr) {
    return;
  }

  const uint32_t startedUs = micros();
  processor(frame, frame_processor_context.load());
  cameraBaseReportProcessingFrame(micros() - startedUs);
}

#if defined(LED_GPIO_NUM)
void enable_led(bool en) {  // Turn LED On or Off
  int duty = en ? led_duty : 0;
  if (en && isStreaming && (led_duty > CONFIG_LED_MAX_INTENSITY)) {
    duty = CONFIG_LED_MAX_INTENSITY;
  }
  ledcWrite(LED_GPIO_NUM, duty);
  //ledc_set_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL, duty);
  //ledc_update_duty(CONFIG_LED_LEDC_SPEED_MODE, CONFIG_LED_LEDC_CHANNEL);
  log_i("Set LED intensity to %d", duty);
}
#endif

static esp_err_t bmp_handler(httpd_req_t *req) {
  camera_fb_t *fb = NULL;
  esp_err_t res = ESP_OK;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  uint64_t fr_start = esp_timer_get_time();
#endif
  fb = esp_camera_fb_get();
  if (!fb) {
    log_e("Camera capture failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  httpd_resp_set_type(req, "image/x-windows-bmp");
  httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.bmp");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  char ts[32];
  snprintf(ts, 32, "%lld.%06ld", fb->timestamp.tv_sec, fb->timestamp.tv_usec);
  httpd_resp_set_hdr(req, "X-Timestamp", (const char *)ts);

  uint8_t *buf = NULL;
  size_t buf_len = 0;
  bool converted = frame2bmp(fb, &buf, &buf_len);
  esp_camera_fb_return(fb);
  if (!converted) {
    log_e("BMP Conversion failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }
  res = httpd_resp_send(req, (const char *)buf, buf_len);
  free(buf);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  uint64_t fr_end = esp_timer_get_time();
#endif
  log_i("BMP: %llums, %uB", (uint64_t)((fr_end - fr_start) / 1000), buf_len);
  return res;
}

static size_t jpg_encode_stream(void *arg, size_t index, const void *data, size_t len) {
  jpg_chunking_t *j = (jpg_chunking_t *)arg;
  if (!index) {
    j->len = 0;
  }
  if (httpd_resp_send_chunk(j->req, (const char *)data, len) != ESP_OK) {
    return 0;
  }
  j->len += len;
  return len;
}

static esp_err_t capture_handler(httpd_req_t *req) {
  camera_fb_t *fb = NULL;
  esp_err_t res = ESP_OK;
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  int64_t fr_start = esp_timer_get_time();
#endif

#if defined(LED_GPIO_NUM)
  enable_led(true);
  vTaskDelay(150 / portTICK_PERIOD_MS);  // The LED needs to be turned on ~150ms before the call to esp_camera_fb_get()
  fb = esp_camera_fb_get();              // or it won't be visible in the frame. A better way to do this is needed.
  enable_led(false);
#else
  fb = esp_camera_fb_get();
#endif

