Cooper3516833584/ESP32S3_Vision/project/CameraWebServer/app_httpd.cpp
  if (!fb) {
    log_e("Camera capture failed");
    httpd_resp_send_500(req);
    return ESP_FAIL;
  }

  httpd_resp_set_type(req, "image/jpeg");
  httpd_resp_set_hdr(req, "Content-Disposition", "inline; filename=capture.jpg");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

  char ts[32];
  snprintf(ts, 32, "%lld.%06ld", fb->timestamp.tv_sec, fb->timestamp.tv_usec);
  httpd_resp_set_hdr(req, "X-Timestamp", (const char *)ts);

#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  size_t fb_len = 0;
#endif
  if (fb->format == PIXFORMAT_JPEG) {
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    fb_len = fb->len;
#endif
    res = httpd_resp_send(req, (const char *)fb->buf, fb->len);
  } else {
    jpg_chunking_t jchunk = {req, 0};
    res = frame2jpg_cb(fb, STREAM_JPEG_QUALITY, jpg_encode_stream, &jchunk) ? ESP_OK : ESP_FAIL;
    httpd_resp_send_chunk(req, NULL, 0);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
    fb_len = jchunk.len;
#endif
  }
  esp_camera_fb_return(fb);
#if ARDUHAL_LOG_LEVEL >= ARDUHAL_LOG_LEVEL_INFO
  int64_t fr_end = esp_timer_get_time();
#endif
  log_i("JPG: %uB %ums", (uint32_t)(fb_len), (uint32_t)((fr_end - fr_start) / 1000));
  return res;
}

static esp_err_t stream_handler(httpd_req_t *req) {
#if STREAM_SINGLE_CLIENT
  bool expected = false;
  if (!stream_client_active.compare_exchange_strong(expected, true)) {
    httpd_resp_set_status(req, "503 Service Unavailable");
    httpd_resp_set_type(req, "text/plain");
    httpd_resp_set_hdr(req, "Retry-After", "1");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    return httpd_resp_sendstr(req, "A low-latency stream client is already connected.\n");
  }
#else
  stream_client_active.store(true);
#endif

  camera_fb_t *fb = NULL;
  struct timeval _timestamp;
  esp_err_t res = ESP_OK;
  size_t _jpg_buf_len = 0;
  uint8_t *_jpg_buf = NULL;
  char part_buf[128];

  int64_t last_frame = esp_timer_get_time();

  res = httpd_resp_set_type(req, _STREAM_CONTENT_TYPE);
  if (res != ESP_OK) {
    stream_client_active.store(false);
    return res;
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  httpd_resp_set_hdr(req, "Cache-Control", "no-store, no-cache, must-revalidate, max-age=0");
  httpd_resp_set_hdr(req, "Pragma", "no-cache");

  // Disable Nagle so a boundary/header is not held while waiting for more
  // bytes. The short send timeout drops a stalled viewer instead of letting
  // old frames queue up and increase latency.
  const int socketFd = httpd_req_to_sockfd(req);
  const int tcpNoDelay = 1;
  const struct timeval sendTimeout = {
    STREAM_SEND_TIMEOUT_MS / 1000,
    (STREAM_SEND_TIMEOUT_MS % 1000) * 1000
  };
  setsockopt(socketFd, IPPROTO_TCP, TCP_NODELAY, &tcpNoDelay, sizeof(tcpNoDelay));
  setsockopt(socketFd, SOL_SOCKET, SO_SNDTIMEO, &sendTimeout, sizeof(sendTimeout));

#if defined(LED_GPIO_NUM)
  isStreaming = true;
  enable_led(true);
#endif

  while (true) {
    fb = esp_camera_fb_get();
    if (!fb) {
      log_e("Camera capture failed");
      res = ESP_FAIL;
    } else {
      _timestamp.tv_sec = fb->timestamp.tv_sec;
      _timestamp.tv_usec = fb->timestamp.tv_usec;
      processFrameForVision(fb);
      if (fb->format != PIXFORMAT_JPEG) {
        bool jpeg_converted = frame2jpg(fb, STREAM_JPEG_QUALITY, &_jpg_buf, &_jpg_buf_len);
        esp_camera_fb_return(fb);
        fb = NULL;
        if (!jpeg_converted) {
          log_e("JPEG compression failed");
          res = ESP_FAIL;
        }
      } else {
        _jpg_buf_len = fb->len;
        _jpg_buf = fb->buf;
      }
    }
    if (res == ESP_OK) {
      res = httpd_resp_send_chunk(req, _STREAM_BOUNDARY, strlen(_STREAM_BOUNDARY));
    }
    if (res == ESP_OK) {
      size_t hlen = snprintf((char *)part_buf, 128, _STREAM_PART, _jpg_buf_len, _timestamp.tv_sec, _timestamp.tv_usec);
      res = httpd_resp_send_chunk(req, (const char *)part_buf, hlen);
    }
    if (res == ESP_OK) {
      res = httpd_resp_send_chunk(req, (const char *)_jpg_buf, _jpg_buf_len);
    }
    if (fb) {
      esp_camera_fb_return(fb);
      fb = NULL;
      _jpg_buf = NULL;
    } else if (_jpg_buf) {
      free(_jpg_buf);
      _jpg_buf = NULL;
    }
    if (res != ESP_OK) {
      stream_send_failures.fetch_add(1);
      log_e("Send frame failed");
      break;
    }
    int64_t fr_end = esp_timer_get_time();
    uint32_t frame_time = (uint32_t)((fr_end - last_frame) / 1000);
    last_frame = fr_end;
    stream_frames.fetch_add(1);
    stream_last_frame_ms.store(frame_time);
    stream_last_frame_bytes.store((uint32_t)_jpg_buf_len);
    const uint32_t instantFpsX10 = frame_time ? (10000U / frame_time) : 0;
    const uint32_t previousFpsX10 = stream_fps_x10.load();
    // A light EWMA keeps the overlay readable without hiding real changes.
    stream_fps_x10.store(previousFpsX10 ? ((previousFpsX10 * 7U + instantFpsX10 * 3U) / 10U) : instantFpsX10);
  }

#if defined(LED_GPIO_NUM)
  isStreaming = false;
  enable_led(false);
#endif

  stream_client_active.store(false);

  return res;
}

static void put_u16_le(uint8_t *p, uint16_t value) {
  p[0] = value & 0xFF;
  p[1] = value >> 8;
}

static void put_u32_le(uint8_t *p, uint32_t value) {
  p[0] = value & 0xFF;
  p[1] = (value >> 8) & 0xFF;
  p[2] = (value >> 16) & 0xFF;
  p[3] = value >> 24;
}

static esp_err_t raw_stream_handler(httpd_req_t *req) {
  bool expected = false;
  if (!stream_client_active.compare_exchange_strong(expected, true)) {
    httpd_resp_set_status(req, "503 Service Unavailable");
    httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
    return httpd_resp_sendstr(req, "A stream client is already connected.\n");
  }
  const size_t pixelCount = 320U * 240U;
  const size_t packedCapacity = pixelCount + (pixelCount + 127U) / 128U + 16U;
  uint8_t *rgb332 = (uint8_t *)ps_malloc(pixelCount);
  uint8_t *packed = (uint8_t *)ps_malloc(packedCapacity);
  if (!rgb332 || !packed) {
    free(rgb332); free(packed); stream_client_active.store(false);
    httpd_resp_send_500(req); return ESP_ERR_NO_MEM;
  }
  esp_err_t res = httpd_resp_set_type(req, "application/x-esp32-raw-stream");
  if (res != ESP_OK) {
    free(rgb332); free(packed); stream_client_active.store(false); return res;
  }
  httpd_resp_set_hdr(req, "Cache-Control", "no-store");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");

