Cooper3516833584/ESP32S3_Vision/project/CameraWebServer/app_httpd.cpp
  const int socketFd = httpd_req_to_sockfd(req);
  const int tcpNoDelay = 1;
  const struct timeval sendTimeout = {
    STREAM_SEND_TIMEOUT_MS / 1000,
    (STREAM_SEND_TIMEOUT_MS % 1000) * 1000
  };
  setsockopt(socketFd, IPPROTO_TCP, TCP_NODELAY, &tcpNoDelay, sizeof(tcpNoDelay));
  setsockopt(socketFd, SOL_SOCKET, SO_SNDTIMEO, &sendTimeout, sizeof(sendTimeout));

  uint32_t sequence = 0;
  int64_t lastFrameUs = esp_timer_get_time();
  while (res == ESP_OK) {
    camera_fb_t *fb = esp_camera_fb_get();
    if (!fb) { res = ESP_FAIL; break; }
    processFrameForVision(fb);
    if (fb->width != 320 || fb->height != 240 || !rawMakeRgb332(fb, rgb332)) {
      esp_camera_fb_return(fb); res = ESP_ERR_NOT_SUPPORTED; break;
    }
    const size_t payloadLength = rawPackBits(rgb332, pixelCount, packed, packedCapacity);
    if (!payloadLength) { esp_camera_fb_return(fb); res = ESP_ERR_NO_MEM; break; }
    uint8_t header[20] = {'R','F','S','1',3,0};
    put_u16_le(header + 6, fb->width);
    put_u16_le(header + 8, fb->height);
    put_u32_le(header + 10, payloadLength);
    put_u32_le(header + 14, sequence++);
    put_u16_le(header + 18, 0);
    res = httpd_resp_send_chunk(req, (const char *)header, sizeof(header));
    if (res == ESP_OK) res = httpd_resp_send_chunk(req, (const char *)packed, payloadLength);
    const uint32_t frameBytes = payloadLength;
    esp_camera_fb_return(fb);
    if (res == ESP_OK) {
      const int64_t nowUs = esp_timer_get_time();
      const uint32_t frameMs = (uint32_t)((nowUs - lastFrameUs) / 1000);
      lastFrameUs = nowUs;
      stream_frames.fetch_add(1);
      stream_last_frame_ms.store(frameMs);
      stream_last_frame_bytes.store(frameBytes);
      const uint32_t fpsX10 = frameMs ? 10000U / frameMs : 0;
      const uint32_t oldFpsX10 = stream_fps_x10.load();
      stream_fps_x10.store(oldFpsX10 ? (oldFpsX10 * 7U + fpsX10 * 3U) / 10U : fpsX10);
    }
  }
  if (res != ESP_OK) stream_send_failures.fetch_add(1);
  free(rgb332);
  free(packed);
  stream_client_active.store(false);
  return res;
}

static esp_err_t metrics_handler(httpd_req_t *req) {
  char json[512];
  const int length = snprintf(
    json,
    sizeof(json),
    "{\"stream_active\":%s,\"ap_clients\":%u,\"frames\":%u,\"send_failures\":%u,"
    "\"last_frame_ms\":%u,\"last_frame_bytes\":%u,\"fps\":%.1f,"
    "\"free_heap\":%u,\"min_free_heap\":%u,\"free_psram\":%u,\"uptime_ms\":%u,"
    "\"processing_fps\":%.1f,\"last_processing_ms\":%.1f}\n",
    stream_client_active.load() ? "true" : "false",
    WiFi.softAPgetStationNum(),
    stream_frames.load(),
    stream_send_failures.load(),
    stream_last_frame_ms.load(),
    stream_last_frame_bytes.load(),
    stream_fps_x10.load() / 10.0f,
    ESP.getFreeHeap(),
    ESP.getMinFreeHeap(),
    ESP.getFreePsram(),
    millis(),
    processing_fps_x10.load() / 10.0f,
    processing_last_time_us.load() / 1000.0f
  );
  httpd_resp_set_type(req, "application/json");
  httpd_resp_set_hdr(req, "Cache-Control", "no-store");
  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, json, length);
}

static esp_err_t parse_get(httpd_req_t *req, char **obuf) {
  char *buf = NULL;
  size_t buf_len = 0;

  buf_len = httpd_req_get_url_query_len(req) + 1;
  if (buf_len > 1) {
    buf = (char *)malloc(buf_len);
    if (!buf) {
      httpd_resp_send_500(req);
      return ESP_FAIL;
    }
    if (httpd_req_get_url_query_str(req, buf, buf_len) == ESP_OK) {
      *obuf = buf;
      return ESP_OK;
    }
    free(buf);
  }
  httpd_resp_send_404(req);
  return ESP_FAIL;
}

static esp_err_t cmd_handler(httpd_req_t *req) {
  char *buf = NULL;
  char variable[32];
  char value[32];

  if (parse_get(req, &buf) != ESP_OK) {
    return ESP_FAIL;
  }
  if (httpd_query_key_value(buf, "var", variable, sizeof(variable)) != ESP_OK || httpd_query_key_value(buf, "val", value, sizeof(value)) != ESP_OK) {
    free(buf);
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }
  free(buf);

  int val = atoi(value);
  log_i("%s = %d", variable, val);
  sensor_t *s = esp_camera_sensor_get();
  int res = 0;

  if (!strcmp(variable, "framesize")) {
    if (s->pixformat == PIXFORMAT_JPEG) {
      res = s->set_framesize(s, (framesize_t)val);
    }
  } else if (!strcmp(variable, "quality")) {
    res = s->set_quality(s, val);
  } else if (!strcmp(variable, "contrast")) {
    res = s->set_contrast(s, val);
  } else if (!strcmp(variable, "brightness")) {
    res = s->set_brightness(s, val);
  } else if (!strcmp(variable, "saturation")) {
    res = s->set_saturation(s, val);
  } else if (!strcmp(variable, "gainceiling")) {
    res = s->set_gainceiling(s, (gainceiling_t)val);
  } else if (!strcmp(variable, "colorbar")) {
    res = s->set_colorbar(s, val);
  } else if (!strcmp(variable, "awb")) {
    res = s->set_whitebal(s, val);
  } else if (!strcmp(variable, "agc")) {
    res = s->set_gain_ctrl(s, val);
  } else if (!strcmp(variable, "aec")) {
    res = s->set_exposure_ctrl(s, val);
  } else if (!strcmp(variable, "hmirror")) {
    res = s->set_hmirror(s, val);
  } else if (!strcmp(variable, "vflip")) {
    res = s->set_vflip(s, val);
  } else if (!strcmp(variable, "awb_gain")) {
    res = s->set_awb_gain(s, val);
  } else if (!strcmp(variable, "agc_gain")) {
    res = s->set_agc_gain(s, val);
  } else if (!strcmp(variable, "aec_value")) {
    res = s->set_aec_value(s, val);
  } else if (!strcmp(variable, "aec2")) {
    res = s->set_aec2(s, val);
  } else if (!strcmp(variable, "dcw")) {
    res = s->set_dcw(s, val);
  } else if (!strcmp(variable, "bpc")) {
    res = s->set_bpc(s, val);
  } else if (!strcmp(variable, "wpc")) {
    res = s->set_wpc(s, val);
  } else if (!strcmp(variable, "raw_gma")) {
    res = s->set_raw_gma(s, val);
  } else if (!strcmp(variable, "lenc")) {
    res = s->set_lenc(s, val);
  } else if (!strcmp(variable, "special_effect")) {
    res = s->set_special_effect(s, val);
  } else if (!strcmp(variable, "wb_mode")) {
    res = s->set_wb_mode(s, val);
  } else if (!strcmp(variable, "ae_level")) {
    res = s->set_ae_level(s, val);
  }
#if defined(LED_GPIO_NUM)
  else if (!strcmp(variable, "led_intensity")) {
    led_duty = val;
    if (isStreaming) {
      enable_led(true);
    }
  }
#endif
  else {
    log_i("Unknown command: %s", variable);
    res = -1;
  }

